test_examples/wireDrawing_OpenFoam_abaqus6/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     CoCoNuT_pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-06;

deltaT          1e-06;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      fixed;

timePrecision   6;

runTimeModifiable false;

adjustTimeStep  no;

boundary_names  ( upWire deformWire finalWire );

functions
{
    PRESSURE_upWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            upWire;
        fields          ( p );
    }
    wallShearStress
    {
        type            wallShearStress;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        log             false;
    }
    TRACTION_upWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            upWire;
        fields          ( wallShearStress );
    }
    PRESSURE_deformWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            deformWire;
        fields          ( p );
    }
    TRACTION_deformWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            deformWire;
        fields          ( wallShearStress );
    }
    PRESSURE_finalWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            finalWire;
        fields          ( p );
    }
    TRACTION_finalWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   6;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            finalWire;
        fields          ( wallShearStress );
    }
}


// ************************************************************************* //
