test_examples/wireDrawing_OpenFoam_abaqus6/CFD/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
315
(
4.9172e-14
4.76796e-14
4.61884e-14
4.46984e-14
4.32096e-14
4.17221e-14
4.02359e-14
3.87508e-14
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
105
(
2.4903e-09
2.48446e-09
2.47862e-09
2.47278e-09
2.46695e-09
2.46111e-09
2.45527e-09
2.44943e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(7.51476e-11 7.53026e-11 7.54575e-11);
    }
    upWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
2.29201e-09
2.29201e-09
2.29201e-09
2.29201e-09
2.29201e-09
2.29201e-09
2.29201e-09
2.29201e-09
...
)
;
    }
    deformWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
2.11722e-09
2.1124e-09
2.10758e-09
2.10276e-09
2.09795e-09
2.09313e-09
2.08831e-09
2.08349e-09
...
)
;
    }
    finalWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
1.87854e-09
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(1.42121e-09 1.46146e-09 1.50172e-09);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
