test_examples/wireDrawing_OpenFoam_abaqus6/CFD/0/ccx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
315
(
-0.00298253
-0.00294741
-0.00291228
-0.00287716
-0.00284204
-0.00280692
-0.0027718
-0.00273668
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
105
(
-0.00298244
-0.00294732
-0.0029122
-0.00287707
-0.00284195
-0.00280682
-0.0027717
-0.00273658
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(0.0005 0.0005 0.0005);
    }
    upWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-0.00298244
-0.00294731
-0.00291219
-0.00287707
-0.00284194
-0.00280682
-0.00277169
-0.00273657
...
)
;
    }
    deformWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
-0.00193006
-0.00189763
-0.00186519
-0.00183275
-0.00180031
-0.00176787
-0.00173544
-0.001703
...
)
;
    }
    finalWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
1.66667e-05
5e-05
8.33333e-05
0.000116667
0.00015
0.000183333
0.000216667
0.00025
0.000283333
0.000316667
0.00035
0.000383333
0.000416667
0.00045
0.000483333
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform -0.003;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
