test_examples/wireDrawing_OpenFoam_abaqus6/CFD/0/ccy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
315
(
0.000757915
0.000757596
0.000757276
0.000756957
0.000756637
0.000756318
0.000755999
0.00075568
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
105
(
0.000810751
0.000808851
0.00080695
0.00080505
0.000803149
0.000801249
0.000799348
0.000797448
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(0.000646051 0.000647383 0.000648716);
    }
    upWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.000747288
0.000747288
0.000747288
0.000747288
0.000747288
0.000747288
0.000747288
0.000747288
...
)
;
    }
    deformWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
0.000746439
0.000744741
0.000743042
0.000741344
0.000739646
0.000737947
0.000736249
0.000734551
...
)
;
    }
    finalWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
0.000645385
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(0.000758074 0.000779544 0.000801013);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
