test_examples/wireDrawing_OpenFoam_abaqus6/CFD/0/ccz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
315
(
-6.52787e-22
2.80693e-21
7.24045e-22
7.97577e-23
-3.80987e-21
1.5865e-21
-1.59553e-21
2.68753e-21
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
105
(
0
0
0
1.70143e-21
-8.52726e-22
0
0
8.58823e-22
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(-9.45304e-22 7.05135e-23 8.71198e-22);
    }
    upWire
    {
        type            calculated;
        value           uniform 0;
    }
    deformWire
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
0
9.95849e-22
0
-1.41334e-22
0
0
0
1.41335e-22
...
)
;
    }
    finalWire
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 3(0 7.19701e-22 0);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
