test_examples/wireDrawing_OpenFoam_abaqus6/CFD/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	 outlet
	 {
		 type          slip;
	 }

	 inlet
	 {
		 type          slip;
	 }
    dieWall
	 {
		 type          fixedValue;
		 value         uniform (0 0 0);
	 }

	back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }



 
 	 upWire 
	 { 
		 type  	 fixedValue; 
		 value	 uniform (0.0 0.0 0.0);
	 } 
 
 	 deformWire 
	 { 
		 type  	 fixedValue; 
		 value	 uniform (0.0 0.0 0.0);
	 } 
 
 	 finalWire 
	 { 
		 type  	 fixedValue; 
		 value	 uniform (0.0 0.0 0.0);
	 } 
} 

// ************************************************************************* //
